In [2]:
import pandas as pd
stocks = pd.read_csv("data/car_stocks.csv")

In [4]:
stocks

,Symbol,Date,Open,High,Low,Close,Adj Close,Volume
0,RIVN,2021-11-10,106.750000,119.459999,95.199997,100.730003,100.730003,103679500
1,RIVN,2021-11-11,114.625000,125.000000,108.010002,122.989998,122.989998,83668200
2,RIVN,2021-11-12,128.645004,135.199997,125.250000,129.949997,129.949997,50437500
3,RIVN,2021-11-15,130.800003,152.529999,127.510002,149.360001,149.360001,64982300
4,RIVN,2021-11-16,163.800003,179.470001,153.779999,172.009995,172.009995,94036600
5,RIVN,2021-11-17,160.880005,163.000000,140.350006,146.070007,146.070007,71765600
6,RIVN,2021-11-18,136.809998,138.779999,120.150002,123.379997,123.379997,63603600
7,RIVN,2021-11-19,129.979996,139.899994,125.599998,128.600006,128.600006,49368200
8,RIVN,2021-11-22,123.879997,124.930000,106.910004,118.110001,118.110001,40993900
9,RIVN,2021-11-23,117.830002,124.000000,113.000000,119.849998,119.849998,24967900
10,RIVN,2021-11-24,119.379997,120.000000,113.449997,114.849998,114.849998,11539200
11,RIVN,2021-11-26,111.000000,114.500000,106.139999,112.129997,112.129997,9871200
12,RIVN,2021-11-29,115.849998,122.250000,113.599998,119.769997,119.769997,13897700
13,LCID,2021-11-10,42.299999,45.000000,39.341000,40.750000,40.750000,79342800
14,LCID,2021-11-11,42.750000,45.750000,41.740002,44.980000,44.980000,69846300
15,LCID,2021-11-12,44.000000,45.189999,42.740002,43.930000,43.930000,40899600
16,LCID,2021-11-15,44.599998,46.139999,43.410000,44.880001,44.880001,77111000
17,LCID,2021-11-16,49.930000,55.680000,46.508999,55.520000,55.520000,248654600
18,LCID,2021-11-17,56.200001,57.750000,50.310001,52.549999,52.549999,198386200
19,LCID,2021-11-18,49.029999,49.669998,43.000000,47.049999,47.049999,131634800
20,LCID,2021-11-19,47.160000,55.400002,47.150002,55.209999,55.209999,166276500
21,LCID,2021-11-22,53.035000,57.439999,50.080002,51.119999,51.119999,130761800
22,LCID,2021-11-23,51.674999,54.330002,49.520000,52.439999,52.439999,87998800
23,LCID,2021-11-24,51.740002,53.500000,49.830002,52.570000,52.570000,61225300
24,LCID,2021-11-26,49.450001,52.369999,49.412998,51.720001,51.720001,36708000
25,LCID,2021-11-29,52.029999,55.330002,50.709999,55.060001,55.060001,76581500
26,GM,2021-11-10,57.849998,60.560001,57.730000,59.270000,59.270000,22778600
27,GM,2021-11-11,59.820000,62.150002,59.310001,61.820000,61.820000,29033900
28,GM,2021-11-12,61.590000,64.029999,61.279999,63.400002,63.400002,31142800
29,GM,2021-11-15,63.660000,63.730000,62.630001,62.970001,62.970001,14372100
30,GM,2021-11-16,63.240002,63.279999,61.930000,62.610001,62.610001,16115000
31,GM,2021-11-17,63.330002,65.070000,62.380001,64.610001,64.610001,29983400
32,GM,2021-11-18,64.330002,65.180000,62.090000,62.330002,62.330002,23308100
33,GM,2021-11-19,62.480000,62.970001,61.560001,61.799999,61.799999,19508500
34,GM,2021-11-22,61.950001,64.959999,61.759998,64.059998,64.059998,19836200
35,GM,2021-11-23,63.730000,64.040001,62.259998,63.049999,63.049999,16225100
36,GM,2021-11-24,62.299999,62.599998,61.630001,62.189999,62.189999,12685000
37,GM,2021-11-26,59.799999,60.570000,59.459999,60.169998,60.169998,13272600
38,GM,2021-11-29,61.110001,61.540001,59.650002,59.860001,59.860001,15022400

**How to get the avg price for each of GM, RIVN, etc in one go**

In [10]:
stocks.groupby("Symbol")["Close"].mean()

Symbol
GM       62.164615
LCID     49.829231
RIVN    127.523077
Name: Close, dtype: float64

In [11]:
titanic =  pd.read_csv("data/titanic.csv")
titanic["age"]  = pd.to_numeric(titanic["age"], errors = "coerce")
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1309 non-null   object
 9   cabin      1309 non-null   object
 10  embarked   1309 non-null   object
 11  boat       1309 non-null   object
 12  body       1309 non-null   object
 13  home.dest  1309 non-null   object
dtypes: float64(1), int64(4), object(9)
memory usage: 143.3+ KB

In [12]:
df = titanic[["pclass", "survived" , "sex" , "age"]]

In [13]:
df.head(1)

   pclass  survived     sex   age
0       1         1  female  29.0

In [15]:
gbo = df.groupby("sex") ##this will just create a groupby object and not actually return anything

In [16]:
gbo.ngroups

2

In [18]:
gbo.groups ##mapping of all indices against different groups

{'female': [0, 2, 4, 6, 8, 11, 12, 13, 17, 18, 21, 23, 24, 27, 28, 32, 33, 35, 36, 41, 42, 43, 44, 48, 50, 55, 57, 59, 61, 63, 65, 66, 67, 69, 72, 73, 76, 78, 79, 82, 83, 85, 88, 90, 92, 95, 97, 98, 99, 102, 103, 104, 105, 107, 108, 111, 112, 113, 116, 117, 121, 122, 124, 127, 129, 130, 131, 134, 137, 139, 141, 144, 146, 149, 153, 155, 159, 160, 161, 163, 167, 168, 169, 176, 178, 180, 181, 182, 186, 187, 188, 190, 192, 193, 195, 198, 199, 204, 207, 208, ...], 'male': [1, 3, 5, 7, 9, 10, 14, 15, 16, 19, 20, 22, 25, 26, 29, 30, 31, 34, 37, 38, 39, 40, 45, 46, 47, 49, 51, 52, 53, 54, 56, 58, 60, 62, 64, 68, 70, 71, 74, 75, 77, 80, 81, 84, 86, 87, 89, 91, 93, 94, 96, 100, 101, 106, 109, 110, 114, 115, 118, 119, 120, 123, 125, 126, 128, 132, 133, 135, 136, 138, 140, 142, 143, 145, 147, 148, 150, 151, 152, 154, 156, 157, 158, 162, 164, 165, 166, 170, 171, 172, 173, 174, 175, 177, 179, 183, 184, 185, 189, 191, ...]}

In [19]:
gbo.first() ## will give the first member of each element of the group

        pclass  survived      age
sex
female       1         1  29.0000
male         1         1   0.9167

In [21]:
gbo.get_group("female") ## will give all elements and all values of a single group

      pclass  survived     sex   age
0          1         1  female  29.0
2          1         0  female   2.0
4          1         0  female  25.0
6          1         1  female  63.0
8          1         1  female  53.0
...      ...       ...     ...   ...
1286       3         1  female  38.0
1290       3         1  female  47.0
1300       3         1  female  15.0
1304       3         0  female  14.5
1305       3         0  female   NaN

[466 rows x 4 columns]

In [22]:
## can even iterate over the groups

for name, group in gbo:
    print(name)
    print("XXXXXXXXXX")
    print(group)

female
XXXXXXXXXX
      pclass  survived     sex   age
0          1         1  female  29.0
2          1         0  female   2.0
4          1         0  female  25.0
6          1         1  female  63.0
8          1         1  female  53.0
...      ...       ...     ...   ...
1286       3         1  female  38.0
1290       3         1  female  47.0
1300       3         1  female  15.0
1304       3         0  female  14.5
1305       3         0  female   NaN

[466 rows x 4 columns]
male
XXXXXXXXXX
      pclass  survived   sex      age
1          1         1  male   0.9167
3          1         0  male  30.0000
5          1         1  male  48.0000
7          1         0  male  39.0000
9          1         0  male  71.0000
...      ...       ...   ...      ...
1302       3         0  male      NaN
1303       3         0  male      NaN
1306       3         0  male  26.5000
1307       3         0  male  27.0000
1308       3         0  male  29.0000

[843 rows x 4 columns]

<h3> Split, Apply, Combine </h3>

- **Split the data into different groups based on some criteria**
- **Apply function(s) to each group indpeendently**
- **Combine the results into a new data structure**

In [25]:
gbo["age"].mean() ##will give avg age of differnet groups

sex
female    28.687071
male      30.585233
Name: age, dtype: float64

In [26]:
titanic.groupby("pclass")["age"].mean()

pclass
1    39.159918
2    29.506705
3    24.816367
Name: age, dtype: float64

In [27]:
titanic.groupby("sex")["pclass"].mean()

sex
female    2.154506
male      2.372479
Name: pclass, dtype: float64

In [32]:
titanic.groupby("sex").mean(numeric_only = True) ## will give mean for each group for each of the remaining columns

          pclass  survived        age     sibsp     parch
sex
female  2.154506  0.727468  28.687071  0.652361  0.633047
male    2.372479  0.190985  30.585233  0.413998  0.247924

<h3> Using the agg function </h3>

**running multiple functions on a groupby object**

In [37]:
titanic.groupby("sex")["age"].agg(["min", "max", "mean", "median"]) ## mention all the functinos you want the operation to run on

           min   max       mean  median
sex
female  0.1667  76.0  28.687071    27.0
male    0.3333  80.0  30.585233    28.0

**Can even specify that for which column we want to run which type of functions**

In [40]:
titanic.groupby("sex").agg({"age": ["min", "max"], 
                                   "pclass": ["mean", "median"]})

           age          pclass
           min   max      mean median
sex
female  0.1667  76.0  2.154506    2.0
male    0.3333  80.0  2.372479    3.0

<h3> Agg with custom functions </h3>

In [42]:
def range(x):
    return x.max() - x.min()

titanic.groupby("pclass")["age"].agg(range) ## agg function automatically passes x param to range function and we dont have to specifically pass it

pclass
1    79.0833
2    69.3333
3    73.8333
Name: age, dtype: float64

In [45]:
def count_nulls(series):
    return series.size - series.count()

titanic.groupby("pclass")["age"].agg(count_nulls)

pclass
1     39
2     16
3    208
Name: age, dtype: int64

<h3> Named Aggregation</h3>

In [48]:
stocks.groupby("Symbol").agg(
    min_open = ("Open", "min"),
    max_open = ("Open", "max"),
    min_close = ("Close", "min"),
    max_close = ("Close", "max"),
) ##we can define the exact column names which we want to get

## we can

          min_open    max_open   min_close   max_close
Symbol
GM       57.849998   64.330002   59.270000   64.610001
LCID     42.299999   56.200001   40.750000   55.520000
RIVN    106.750000  163.800003  100.730003  172.009995